{
  "id": "bilicho",
  "title": "Bilicho - Enhancing Documentation Understanding with GPT-3.5 Turbo and RAG",
  "date": "May 27, 2025",
  "authors": [
    {
      "name": "Anwar Misbah",
      "email": "anwar@chapa.co"
    },
    { "name": "Israel Goytom", "email": "israel@chapa.com" }
  ],
  "shortDescription": "Bilicho is an AI assistant by Chapa that helps developers integrate faster by answering API questions using smart documentation search.",
  "longDescription": "<p>Chapa, a fintech startup in Ethiopia, created Bilicho to simplify the developer onboarding process. Integration with payment infrastructure often involves sifting through complex documentation and repetitive support queries. Bilicho was introduced as a pragmatic solution: an AI assistant that understands developer questions and delivers targeted, doc-based answers without over-engineering.</p> <p>Built on GPT-3.5 Turbo, Bilicho uses RAG to dynamically retrieve relevant documentation fragments based on developer queries. This hybrid approach ensures responses are both contextually intelligent and grounded in accurate source material. The team detailed their method in the technical report, explaining choice of prompts, retrieval index, fine-tuning, infrastructure, latency, and cost breakdowns—highlighting a cost-effective strategy suitable for startups.</p><p>Since its deployment, Bilicho has markedly improved Chapa's developer experience. The number of back-and-forth support tickets has dropped, as Bilicho reliably assists with questions about APIs, webhooks, SDK usage, debugging, and optimization. Its conversational tone and helpful 'personality' make technical guidance more intuitive and accessible.</p><p>Bilicho demonstrates a practical and scalable application of open-source AI for documentation support. By integrating GPT-3.5 with RAG in a lightweight setup, Chapa offers a template other startups can adopt: intelligent, efficient, and developer-friendly AI assistance without expensive infrastructure. As noted by Chapa's CTO: “Nothing too fancy, just a practical, cost-effective approach that startups can adapt.”</p>",
  "imgSrc": "/images/research/bilicho.jpeg",
  "link": "/researches/Bilicho.pdf"
}
